[
  {
    "i": "1",
    "link": "https://www.youtube.com/watch?v=2lWTuxq65gs",
    "description": {
      "headline": "Launch of the India-Finland Startup Hub | Scaling Up In Finland",
      "content": "We are here to tell you why and how you can startup in Finland! Presenting an exciting line up of speakers to launch the India-Finland Startup Hub, a unique collaboration between Business Finland and Headstart Network Foundation which aims to bridge Indian and Finnish startup ecosystems. Know the kind of support & opportunities available for your startup in Finland, through the webinar.Please take a moment to join our online community especially created to educate entrepreneurs about the opportunity available in the Indian and Finnish startup ecosystems. You can get in touch with the team by posting your queries there, too."
    }
  },
  {
    "i": "2",
    "link": "https://www.youtube.com/watch?v=eNgbm7WqAC8",
    "description": {
      "headline": "Accelerate your Business in Finland | Business Finland | Headstart",
      "content": "India - Finland Startup Hub knowledge series - meet top accelerators from Finland.  After a successful launch of the India-Finland Startup Hub, we are excited to bring to you the second webinar of the series ‘Scaling Up in Finland’. Do you want to accelerate your business in Finland? Look nowhere, we have an amazing roster of speakers, all of whom are the best in their fields and are here to share their experiences with you.."
    }
  },
  {
    "i": "3",
    "link": "https://www.youtube.com/watch?v=A4j8eMzlbKY",
    "description": {
      "headline": "Finland The Next Market For Your Startup | Business Finland | Headstart",
      "content": "The startup ecosystem in Finland is bursting with potential. Learn how Finland could be the next market for your startup from an amazing line-up of speakers from leading corporates, accelerators & startups.   An exciting roster consisting of Ajay Garg, speaker & mentor Startup Refugees, The Shortcut, Nitin Agrawal, Ph.D., Co-founded an innovation consultancy: ExtraVerd Oy, Sandeep Shah, Senior business advisor at Helsinki Business Hub, Ville Simola, Chief Executive Officer at Maria 01, Chandrashekar Subramanian, Director - Key Accounts & Country Manager at Infosys and Puneet Thakur, Head of Invest in and Innovation Collaboration at Business Finland. Join us as they will share insights on the potential Finland has to offer, a new market for your startups."
    }
  },
  {
    "i": "4",
    "link": "https://www.youtube.com/watch?v=mEs-Zksxu3w",
    "description": {
      "headline": "All About Sustainability & Circular Economy | Building for the Future",
      "content": "We bring to you for the very first time a collision between Sustainability and Circular Economy with Startups. IFSH presents to you our next event “Building for the Future- All about Sustainability & Circular Economy” <br/>India-Finland Startup Hub is back with exciting opportunities for startups in Finland and India. IFSH is a collaboration between Business Finland and Headstart Network Foundation which aims to bridge Indian and Finnish startup ecosystems.<br/> 5 experts in their field, both from India and Finland.<br/> Get more insight on the kind of support & opportunities available for your startup in Finland and the workings of starting up in Finland.<br/> Enabling strong startup ecosystems in India & Finland.<br/>  We have got a great roster of speakers, brilliant minds such as Maria Hughes (Specialist, Global collaboration, Sustainability solutions, Sitra), Kimmo Heinonen (Business Development Advisor, Testbed Helsinki), Kaisa Ahonen (Project Manager, Urban Tech Helsinki), Samuel John (Misteo, CEO & Co-Founder) & Abhishek Kumar D. (Ekotekt, Founder & CEO"
    }
  },
  {
    "i": "5",
    "link": "https://www.youtube.com/watch?v=nAZj0hlG0ns",
    "description": {
      "headline": "Ashish Srivastava | Opportunities & Business Development In Finland",
      "content": "Headstart in collaboration with Business Finland is back with India Finland Startup Hub. Today we have Ashish Srivastava(CEO, Finland Education Hub) with us discussing about the process of setting up the operations of your startup in Finland.<br/>Apply for the 2nd cohort of our program ‘Relocation to Finland’ which opens up gates of the European market to selected startups with the potential to scale in Europe.<br/> If you are an entrepreneur looking to explore the European market/relocating to Finland, then this is your golden ticket."
    }
  },
  {
    "i": "6",
    "link": "https://www.youtube.com/watch?v=Q9H94Yu2uxk",
    "description": {
      "headline": "Nilesh Sahasrabudhe | Opportunities & Business Development In Finland ",
      "content": "Headstart in collaboration with Business Finland is back with India Finland Startup Hub. Today we have Nilesh Sahasrabudhe(Founder & CEO, Nordicmojo) with us discussing about the process of setting up the operations of your startup in Finland.<br/>Apply for the 2nd cohort of our program ‘Relocation to Finland’ which opens up gates of the European market to selected startups with the potential to scale in Europe.<br/> If you are an entrepreneur looking to explore the European market/relocating to Finland, then this is your golden ticket."
    }
  },
  {
    "i": "7",
    "link": "https://www.youtube.com/watch?v=i8yEBR2YVAk",
    "description": {
      "headline": "Parneet Bajaj | Opportunities & Business Development In Finland",
      "content": "Headstart in collaboration with Business Finland is back with India Finland Startup Hub. Today we have Parneet Bajaj (CEO, Mandatory Training Group) with us discussing about the process of setting up the operations of your startup in Finland.<br/>Apply for the 2nd cohort of our program ‘Relocation to Finland’ which opens up gates of the European market to selected startups with the potential to scale in Europe.<br/>If you are an entrepreneur looking to explore the European market/relocating to Finland, then this is your golden ticket."
    }
  },
  {
    "i": "8",
    "link": "https://www.youtube.com/watch?v=-Wf0lvNNWdw",
    "description": {
      "headline": "From Starting Up To Excelling In India & Finland | India-Finland Startup Hub",
      "content": "IFSH is a collaboration between Business Finland and Headstart Network Foundation which aims to bridge Indian 🇮🇳 and Finnish 🇫🇮 startup ecosystems. It brings exciting opportunities for startups in Finland and India. <br/>We have got a great roster of speakers, brilliant minds such as Lars Hagebris – Business Finland, Shivangi Jain – Invest India, Amit Singh – Headstart,  Harjoth Singh – Trilleco, Puneet Thakur – Business Finland,  Patrik Holopainen – Kiuas, Mirza Sagdati – Red Brick Accelerator, Divya Pritwani – AIC-MUJ (Atal Incubation Center-Manipal University Jaipur), Amey Mashelkar – JioGenNext, Jaana Rantanen – Business Finland,  Suresh Bhagavatula – Indian Institute of Management Bangalore, Mika Tirronen - InfoCare, Dr M.S. Narayanan – IIT Madras Bioincubator, Santeri Ojala – Business Finland,  Aarzoo Jain – Headstart.<br/> Watch the entire session and get more insight on the kind of support & opportunities available for your startup in Finland and the workings of starting up in Finland."
    }
  },
  {
    "i": "9",
    "link": "https://www.youtube.com/watch?v=NeFwDaQpHi0",
    "description": {
      "headline": "The Edtech Startup Ecosystem: Opportunities & Business Development |",
      "content": "IFSH presents to you our next event “Educating the Next Billion- The Edtech startup ecosystem: Opportunities and Business Development”<br/>5 experts in their field, both from India and Finland, enabling strong startup ecosystems in India & Finland.<br/>We have got a great roster of speakers, brilliant minds such as Jussi Kajala Kimmo Koponen , Misa-Stiina Heikkala, Divya Bhat & Ashish Srivastava."
    }
  }
]
